{"format": "graph-model", "generatedBy": "2.11.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "signature": {"inputs": {"xs_0": {"name": "xs_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "100"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/jax2tf_arg_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/DQN/Dense_0/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/DQN/jit_relu_/jit__lambda__/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_3/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "100"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/DQN/Dense_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "100"}]}}}}}, {"name": "xs_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "4"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/DQN/Dense_0/MatMul", "op": "MatMul", "input": ["xs_0", "StatefulPartitionedCall/jax2tf_arg_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/DQN/Dense_0/jit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/DQN/Dense_0/MatMul", "StatefulPartitionedCall/jax2tf_apply_/DQN/Dense_0/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/DQN/jit_relu_/jit__lambda__/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/jax2tf_apply_/DQN/Dense_0/jit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/DQN/jit_relu_/jit__lambda__/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/DQN/Dense_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/jax2tf_apply_/DQN/jit_relu_/jit__lambda__/Maximum", "StatefulPartitionedCall/jax2tf_arg_3/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/DQN/Dense_1/jit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/DQN/Dense_1/MatMul", "StatefulPartitionedCall/jax2tf_apply_/DQN/Dense_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/jax2tf_apply_/DQN/Dense_1/jit_fn_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1286}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/jax2tf_arg_1/ReadVariableOp", "shape": [4, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/DQN/Dense_0/Reshape", "shape": [1, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/DQN/jit_relu_/jit__lambda__/Cast", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_arg_3/ReadVariableOp", "shape": [64, 100], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_apply_/DQN/Dense_1/Reshape", "shape": [1, 100], "dtype": "float32"}]}]}